# Sección 3

## Prueba Data Science
### Candidato: LUIS IVAN UMPIRE ALVAREZ

# Caso Ventas de autos y motocicletas

### Modelado de datos

Dentro de las variables se identifica cuatro tablas que son:

●	**Cliente**: ID Cliente, Nombre del cliente, ciudad, país, dirección, teléfono, territorio, etc.

●	**Producto**: Código del producto, precio base del producto.

●	**Orden**: Número de orden de la venta, ID Cliente, Fecha de la venta, Año, Trimestre, Mes y Estado de la venta.

●	**Detalle de la venta**: ID Cliente, Número de Orden de la venta, Código del producto, Cantidad ordenada, precio unitario del producto, venta del producto.

In [30]:
# importar las librerias necesarias
import pandas as pd
import matplotlib.pyplot as plt

### Extraer el archivo fuente

Solo vamos a extraer la hoja 'sales_data_sample', porque es una **fact table**, es decir que ahí podemos obtener toda la información transaccional de las ventas.

In [6]:

df_sales = pd.read_excel('venta_vehiculos.xlsx', sheet_name='sales_data_sample')

### Overview a la información

In [9]:
df_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2823 entries, 0 to 2822
Data columns (total 25 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   ORDERNUMBER       2823 non-null   int64
 1   QUANTITYORDERED   2823 non-null   int64
 2   PRICEEACH         2823 non-null   float64
 3   ORDERLINENUMBER   2823 non-null   int64
 4   SALES             2823 non-null   float64
 5   ORDERDATE         2823 non-null   object
 6   STATUS            2823 non-null   object
 7   QTR_ID            2823 non-null   int64
 8   MONTH_ID          2823 non-null   int64
 9   YEAR_ID           2823 non-null   int64
 10  PRODUCTLINE       2823 non-null   object
 11  MSRP              2823 non-null   int64
 12  PRODUCTCODE       2823 non-null   object
 13  CUSTOMERNAME      2823 non-null   object
 14  PHONE             2823 non-null   object
 15  ADDRESSLINE1      2823 non-null   object
 16  ADDRESSLINE2      302 non-null    object
 17  CITY              2823 non-null   object
 18  STATE             1337 non-null   object
 19  POSTALCODE        2747 non-null   object
 20  COUNTRY           2823 non-null   object
 21  TERRITORY         1749 non-null   object
 22  CONTACTLASTNAME   2823 non-null   object
 23  CONTACTFIRSTNAME  2823 non-null   object
 24  DEALSIZE          2823 non-null   object
dtypes: float64(2), int64(7), object(16)
memory usage: 551.5+ KB

In [7]:
df_sales.head(10)

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,10100,30,100.00,3,5151.00,1/6/2003 0:00,Shipped,1,1,2003,...,2304 Long Airport Avenue,NaN,Nashua,NH,62005,USA,NaN,Young,Valarie,Medium
1,10100,50,67.80,2,3390.00,1/6/2003 0:00,Shipped,1,1,2003,...,2304 Long Airport Avenue,NaN,Nashua,NH,62005,USA,NaN,Young,Valarie,Medium
2,10100,22,86.51,4,1903.22,1/6/2003 0:00,Shipped,1,1,2003,...,2304 Long Airport Avenue,NaN,Nashua,NH,62005,USA,NaN,Young,Valarie,Small
3,10100,49,34.47,1,1689.03,1/6/2003 0:00,Shipped,1,1,2003,...,2304 Long Airport Avenue,NaN,Nashua,NH,62005,USA,NaN,Young,Valarie,Small
4,10101,25,100.00,4,3782.00,1/9/2003 0:00,Shipped,1,1,2003,...,Lyonerstr. 34,NaN,Frankfurt,NaN,60528,Germany,EMEA,Keitel,Roland,Medium
5,10101,26,100.00,1,3773.38,1/9/2003 0:00,Shipped,1,1,2003,...,Lyonerstr. 34,NaN,Frankfurt,NaN,60528,Germany,EMEA,Keitel,Roland,Medium
6,10101,45,31.20,3,1404.00,1/9/2003 0:00,Shipped,1,1,2003,...,Lyonerstr. 34,NaN,Frankfurt,NaN,60528,Germany,EMEA,Keitel,Roland,Small
7,10101,46,53.76,2,2472.96,1/9/2003 0:00,Shipped,1,1,2003,...,Lyonerstr. 34,NaN,Frankfurt,NaN,60528,Germany,EMEA,Keitel,Roland,Small
8,10102,39,100.00,2,4808.31,1/10/2003 0:00,Shipped,1,1,2003,...,2678 Kingston Rd.,Suite 101,NYC,NY,10022,USA,NaN,Frick,Michael,Medium
9,10102,41,50.14,1,2055.74,1/10/2003 0:00,Shipped,1,1,2003,...,2678 Kingston Rd.,Suite 101,NYC,NY,10022,USA,NaN,Frick,Michael,Small

In [8]:
df_sales.describe()

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,QTR_ID,MONTH_ID,YEAR_ID,MSRP
count,2823.000000,2823.000000,2823.000000,2823.000000,2823.000000,2823.000000,2823.000000,2823.00000,2823.000000
mean,10258.725115,35.092809,83.658544,6.466171,3553.889072,2.717676,7.092455,2003.81509,100.715551
std,92.085478,9.741443,20.174277,4.225841,1841.865106,1.203878,3.656633,0.69967,40.187912
min,10100.000000,6.000000,26.880000,1.000000,482.130000,1.000000,1.000000,2003.00000,33.000000
25%,10180.000000,27.000000,68.860000,3.000000,2203.430000,2.000000,4.000000,2003.00000,68.000000
50%,10262.000000,35.000000,95.700000,6.000000,3184.800000,3.000000,8.000000,2004.00000,99.000000
75%,10333.500000,43.000000,100.000000,9.000000,4508.000000,4.000000,11.000000,2004.00000,124.000000
max,10425.000000,97.000000,100.000000,18.000000,14082.800000,4.000000,12.000000,2005.00000,214.000000

# 1- Análisis descriptivo

### Ver los valores únicos de las columnas de mayor interés

In [14]:
print('STATUS: ', df_sales['STATUS'].unique())
print('\nQTR_ID: ', df_sales['QTR_ID'].unique())
print('\nMONTH_ID: ', df_sales['MONTH_ID'].unique())
print('\nYEAR_ID: ', df_sales['YEAR_ID'].unique())
print('\nPRODUCTLINE: ', df_sales['PRODUCTLINE'].unique())
print('\nCUSTOMERNAME: ', df_sales['CUSTOMERNAME'].unique())
print('\nCITY: ', df_sales['CITY'].unique())
print('\nCOUNTRY: ', df_sales['COUNTRY'].unique())

STATUS:  ['Shipped' 'Resolved' 'Cancelled' 'On Hold' 'Disputed' 'In Process']

QTR_ID:  [1 2 3 4]

MONTH_ID:  [ 1  2  3  4  5  6  7  8  9 10 11 12]

YEAR_ID:  [2003 2004 2005]

PRODUCTLINE:  ['Vintage Cars' 'Classic Cars' 'Trucks and Buses' 'Trains' 'Ships'
 'Planes' 'Motorcycles']

CUSTOMERNAME:  ['Online Diecast Creations Co.' 'Blauer See Auto, Co.' 'Vitachrome Inc.'
 'Baane Mini Imports' 'Euro Shopping Channel' 'Danish Wholesale Imports'
 'Rovelli Gifts' 'Land of Toys Inc.' 'Cruz & Sons Co.'
 'Motor Mint Distributors Inc.' 'AV Stores, Co.' 'Mini Wheels Co.'
 'Volvo Model Replicas, Co' 'Mini Gifts Distributors Ltd.'
 "La Corne D'abondance, Co." 'Classic Legends Inc.' 'Royale Belge'
 'Dragon Souveniers, Ltd.' 'Enaco Distributors' 'Salzburg Collectables'
 'Australian Collectors, Co.' 'Reims Collectables' 'Marseille Mini Autos'
 'Atelier graphique' 'Signal Gift Stores' 'Corrida Auto Replicas, Ltd'
 'Muscle Machine Inc' 'Stylish Desk Decors, Co.' 'Auto-Moto Classics Inc.'
 'Gift Ideas Corp.' 'Lyon Souveniers' 'Alpha Cognac'
 'Souveniers And Things Co.' 'Technics Stores Inc.' 'Suominen Souveniers'
 'Mini Creations Ltd.' 'Toys4GrownUps.com' 'Collectables For Less Inc.'
 "Anna's Decorations, Ltd" 'Signal Collectibles Ltd.'
 'Oulu Toy Supplies, Inc.' 'Australian Gift Network, Co'
 'Boards & Toys Co.' 'Toys of Finland, Co.' 'Corporate Gift Ideas Co.'
 "Men 'R' US Retailers, Ltd." 'Heintze Collectables' 'Mini Auto Werke'
 'FunGiftIdeas.com' 'Scandinavian Gift Ideas'
 'Quebec Home Shopping Network' 'Gift Depot Inc.' "L'ordine Souveniers"
 'CAF Imports' 'Daedalus Designs Imports' 'Herkku Gifts'
 'Classic Gift Ideas, Inc' 'Iberia Gift Imports, Corp.'
 'Double Decker Gift Stores, Ltd' 'Toms Spezialitten, Ltd'
 'Australian Collectables, Ltd' 'Saveley & Henriot, Co.' 'Mini Classics'
 'Super Scale Inc.' 'West Coast Collectables Co.'
 'Canadian Gift Exchange Network' 'Diecast Collectables'
 'Osaka Souveniers Co.' 'Auto Canal Petit' 'Auto Assoc. & Cie.'
 'Handji Gifts& Co' 'Clover Collections, Co.' 'Petit Auto'
 'Collectable Mini Designs Co.' 'Vida Sport, Ltd'
 'Cambridge Collectables Co.' 'giftsbymail.co.uk'
 'Tekni Collectables Inc.' 'Royal Canadian Collectables, Ltd.'
 'Mini Caravy' 'Microscale Inc.' 'The Sharp Gifts Warehouse'
 'UK Collectables, Ltd.' 'Tokyo Collectables, Ltd' 'Gifts4AllAges.com'
 'Diecast Classics Inc.' 'La Rochelle Gifts' 'Online Mini Collectables'
 'Amica Models & Co.' 'Norway Gifts By Mail, Co.' "Marta's Replicas Co."
 'Bavarian Collectables Imports, Co.']

CITY:  ['Nashua' 'Frankfurt' 'NYC' 'Stavern' 'Madrid' 'Kobenhavn' 'Bergamo'
 'Makati City' 'Philadelphia' 'Manchester' 'San Francisco' 'Lule'
 'San Rafael' 'Paris' 'Charleroi' 'Singapore' 'Barcelona' 'Salzburg'
 'Melbourne' 'Reims' 'Marseille' 'Nantes' 'Las Vegas' 'London'
 'Brickhaven' 'Glendale' 'Toulouse' 'Chatswood' 'Burlingame' 'Espoo'
 'New Bedford' 'Pasadena' 'North Sydney' 'Brisbane' 'Oulu'
 'South Brisbane' 'Helsinki' 'Los Angeles' 'Aaarhus' 'Graz' 'Boras'
 'Montreal' 'Bridgewater' 'Reggio Emilia' 'Lille' 'Bergen' 'Sevilla'
 'Koln' 'Glen Waverly' 'Lyon' 'White Plains' 'New Haven' 'Burbank'
 'Vancouver' 'Boston' 'Osaka' 'Versailles' 'Dublin' 'Bruxelles'
 'San Diego' 'Gensve' 'Cambridge' 'Cowes' 'Newark' 'Tsawassen'
 'Strasbourg' 'San Jose' 'Liverpool' 'Minato-ku' 'Allentown' 'Torino'
 'Oslo' 'Munich']

COUNTRY:  ['USA' 'Germany' 'Norway' 'Spain' 'Denmark' 'Italy' 'Philippines' 'UK'
 'Sweden' 'France' 'Belgium' 'Singapore' 'Austria' 'Australia' 'Finland'
 'Canada' 'Japan' 'Ireland' 'Switzerland']

In [36]:
pd.options.display.float_format = '{:,.2f}'.format

In [37]:
# Ventas por YEAR_ID:
df_sales_year = df_sales.pivot_table(index=None, 
                                         columns='YEAR_ID', 
                                         values='SALES', 
                                         aggfunc='sum', 
                                         margins=False)

df_sales_year = df_sales_year.reset_index()
df_sales_year

YEAR_ID  index         2003         2004         2005
0        SALES 3,516,979.54 4,724,162.60 1,791,486.71

In [38]:
# Ventas por STATUS:
df_sales_status = df_sales.pivot_table(index='STATUS', 
                                         columns='YEAR_ID', 
                                         values='SALES', 
                                         aggfunc='sum', 
                                         margins=True)

df_sales_status = df_sales_status.reset_index()
df_sales_status

YEAR_ID      STATUS         2003         2004         2005           All
0         Cancelled    48,710.92   145,776.56          NaN    194,487.48
1          Disputed          NaN          NaN    72,212.86     72,212.86
2        In Process          NaN          NaN   144,729.96    144,729.96
3           On Hold          NaN    26,260.21   152,718.98    178,979.19
4          Resolved    28,550.59    24,078.61    98,089.08    150,718.28
5           Shipped 3,439,718.03 4,528,047.22 1,323,735.83  9,291,501.08
6               All 3,516,979.54 4,724,162.60 1,791,486.71 10,032,628.85

In [55]:
# Ventas por PRODUCTLINE:
df_sales_line = df_sales.pivot_table(index='PRODUCTLINE', 
                                         columns='YEAR_ID', 
                                         values='SALES', 
                                         aggfunc='sum', 
                                         margins=True)

df_sales_line = df_sales_line.reset_index()

df_sales_line.sort_values('All', ascending=True)

YEAR_ID       PRODUCTLINE         2003         2004         2005           All
4                  Trains    72,802.29   116,523.85    36,917.33    226,243.47
3                   Ships   244,821.09   341,437.97   128,178.07    714,437.13
2                  Planes   272,257.60   502,671.80   200,074.17    975,003.57
5        Trucks and Buses   420,429.93   529,302.89   178,057.02  1,127,789.84
1             Motorcycles   370,895.58   560,545.23   234,947.53  1,166,388.34
6            Vintage Cars   650,987.76   911,423.77   340,739.31  1,903,150.84
0            Classic Cars 1,484,785.29 1,762,257.09   672,573.28  3,919,615.66
7                     All 3,516,979.54 4,724,162.60 1,791,486.71 10,032,628.85

In [40]:
# Ventas por CITY:
df_sales_city = df_sales.pivot_table(index='CITY', 
                                         columns='YEAR_ID', 
                                         values='SALES', 
                                         aggfunc='sum', 
                                         margins=False)

df_sales_city = df_sales_city.reset_index()
df_sales_city

YEAR_ID          CITY      2003       2004      2005
0             Aaarhus 40,321.61  60,273.94       NaN
1           Allentown       NaN 115,971.34  6,166.80
2           Barcelona 48,228.51  30,183.35       NaN
3             Bergamo 96,259.03  41,696.69       NaN
4              Bergen 95,277.18  16,363.10       NaN
..                ...       ...        ...       ...
68           Toulouse 55,349.32        NaN 15,139.12
69          Tsawassen       NaN  74,634.85       NaN
70          Vancouver 38,662.21  36,576.71       NaN
71         Versailles       NaN  64,834.32       NaN
72       White Plains 38,682.95  46,873.04       NaN

[73 rows x 4 columns]

In [49]:
# Ventas por COUNTRY:
df_sales_country = df_sales.pivot_table(index='COUNTRY', 
                                         columns='YEAR_ID', 
                                         values='SALES', 
                                         aggfunc='sum', 
                                         margins=True)

df_sales_country = df_sales_country.reset_index()
df_sales_country.sort_values('All', ascending=True)

YEAR_ID      COUNTRY         2003         2004         2005           All
8            Ireland          NaN    57,756.43          NaN     57,756.43
12       Philippines    78,086.98    15,928.75          NaN     94,015.73
2            Belgium     3,348.46    80,024.05    25,040.11    108,412.62
16       Switzerland          NaN   117,713.56          NaN    117,713.56
10             Japan          NaN   149,422.47    38,745.34    188,167.81
1            Austria    82,117.88    51,694.39    68,250.26    202,062.53
15            Sweden    58,459.92   119,947.57    31,606.72    210,014.21
7            Germany    70,053.31   150,418.78          NaN    220,472.09
3             Canada    54,609.50   135,776.09    33,692.97    224,078.56
4            Denmark    99,192.72   120,431.56    26,012.87    245,637.15
13         Singapore   165,686.20   116,039.03     6,763.18    288,488.41
11            Norway   196,532.60   110,931.10          NaN    307,463.70
5            Finland   111,154.51    91,575.69   126,851.71    329,581.91
9              Italy   140,928.77   192,235.60    41,509.94    374,674.31
17                UK   180,421.55   257,656.10    40,802.81    478,880.46
0          Australia   253,134.45   232,396.68   145,091.97    630,623.10
6             France   312,761.42   555,198.70   242,956.40  1,110,916.52
14             Spain   405,343.39   483,545.36   326,798.17  1,215,686.92
18               USA 1,305,147.88 1,685,470.69   637,364.26  3,627,982.83
19               All 3,516,979.54 4,724,162.60 1,791,486.71 10,032,628.85

### Resumen

- Los paises donde mas se venden son **USA, Spain, y France**.

- En el año 2005 disminuyen las ventas, esto puede deberse a qué no se cuenta con información de ventas de todo el 2005, hay que averiguar por Quarter.

- Los **'Classic Cars' y 'Vintage Cars'** son los mas vendidos.

In [57]:
# Ventas por YEAR_ID:
df_sales_quarter = df_sales.pivot_table(index='QTR_ID', 
                                         columns='YEAR_ID', 
                                         values='SALES', 
                                         aggfunc='sum', 
                                         margins=False)

df_sales_quarter = df_sales_quarter.reset_index()
df_sales_quarter

YEAR_ID  QTR_ID         2003         2004         2005
0             1   445,094.69   833,730.68 1,071,992.36
1             2   562,365.22   766,260.73   719,494.35
2             3   649,514.54 1,109,396.27          NaN
3             4 1,860,005.09 2,014,774.92          NaN

**Efectivamente, las ventas del 2005 no consideran todo el año, sino solamente hasta el 2nd quarter.**